'''
а) Дана послідовність цілих чисел а1, ..., аn. Для кожного з чисел, що входять в
послідовність а1, ..., аn з'ясувати, скільки разів воно входить в цю послідовність.
Результат представити у вигляді ряду рядків, перший з яких є а1 - k, де k - число входжень
а1 в послідовність а1, ..., аn. Другий рядок буде мати вигляд аj - m, де аj - перший по
порядку член послідовності, відмінний від а1, а m - число входжень цього члена в
послідовність.
'''
from random import randint

n = int(input('Введіть довжину послідовності: '))
a = [randint(0, 7) for i in range(n)]
b = []
print(a)
for k in a:
    g = a.count(k)
    if k not in b:
        b.append(k)
    else:
        continue
    print(k, '-', g)
